# =========================================
# エプソンCSV列
# =========================================

EPSON_COLUMNS = [

    "月種別",
    "種類",
    "形式",
    "作成方法",
    "付箋",
    "伝票日付",
    "伝票番号",
    "伝票摘要",
    "枝番",

    "借方部門",
    "借方部門名",
    "借方科目",
    "借方科目名",
    "借方補助",
    "借方補助科目名",
    "借方金額",
    "借方消費税コード",
    "借方消費税業種",
    "借方消費税税率",
    "借方資金区分",
    "借方任意項目１",
    "借方任意項目２",
    "借方インボイス情報",

    "貸方部門",
    "貸方部門名",
    "貸方科目",
    "貸方科目名",
    "貸方補助",
    "貸方補助科目名",
    "貸方金額",
    "貸方消費税コード",
    "貸方消費税業種",
    "貸方消費税税率",
    "貸方資金区分",
    "貸方任意項目１",
    "貸方任意項目２",
    "貸方インボイス情報",

    "摘要",
    "期日",
    "証番号",

    "入力マシン",
    "入力ユーザ",
    "入力アプリ",
    "入力会社",
    "入力日付",
]

# =========================================
# 検索対象列
# =========================================

SEARCH_COLUMNS = [

    "摘要",
    "伝票摘要",

    "借方科目名",
    "貸方科目名",

    "借方補助科目名",
    "貸方補助科目名",

]

# =========================================
# 編集対象列
# =========================================

EDIT_COLUMNS = [

    "借方科目名",
    "貸方科目名",

    "借方補助科目名",
    "貸方補助科目名",

    "借方金額",
    "貸方金額",

    "摘要",
]

# =========================================
# 表示対象列
# =========================================

DISPLAY_COLUMNS = [

    "伝票日付",

    "借方科目名",
    "貸方科目名",

    "借方補助科目名",
    "貸方補助科目名",

    "借方金額",
    "貸方金額",

    "摘要",
]

COL_DATE = "伝票日付"

COL_DEBIT = "借方科目名"
COL_CREDIT = "貸方科目名"

COL_DEBIT_SUB = "借方補助科目名"
COL_CREDIT_SUB = "貸方補助科目名"

COL_DEBIT_AMOUNT = "借方金額"
COL_CREDIT_AMOUNT = "貸方金額"

COL_SUMMARY = "摘要"